eisup_2019_docmng_integration/src/Documents/абс_РеклассификацияБюджетаДДС/абс_РеклассификацияБюджетаДДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_РеклассификацияБюджетаДДС</name>
  <basedOn>Document.АвансовыйОтчет</basedOn>
  <basedOn>Document.АктОбОказанииПроизводственныхУслуг</basedOn>
  <basedOn>Document.ТребованиеНакладная</basedOn>
  <basedOn>Document.ПередачаТоваров</basedOn>
  <basedOn>Document.РеализацияТоваровУслуг</basedOn>
  <basedOn>Document.ПоступлениеТоваровУслуг</basedOn>
  <basedOn>Document.ПеремещениеТоваров</basedOn>
  <basedOn>Document.ПолучениеУслугПоПереработке</basedOn>
  <registerRecords>InformationRegister.абс_УстановкаЛимитовПоСтатьям</registerRecords>
  <registerRecords>AccumulationRegister.ОборотыБюджетов</registerRecords>
  <registerRecords>AccumulationRegister.КонтролируемыеЗначенияБюджетов</registerRecords>
  <attributes>
    <name>Причина</name>
    <type>
      <types>CatalogRef.абс_ПричиныРеклассификацииБюджета</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникПериодМесяц</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникЦФУ</name>
    <type>
      <types>CatalogRef.абс_ЦФУ</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникЦФО</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникСтатьяОборотов</name>
    <type>
      <types>CatalogRef.СтатьиОборотовПоБюджетам</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникТипКонтрагента</name>
    <type>
      <types>CatalogRef.абс_ТипыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникТипРасхода</name>
    <type>
      <types>CatalogRef.абс_ТипыРасходовНаПроизводствоИРеализацию</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникТЭО</name>
    <type>
      <types>CatalogRef.абс_ТЭО</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникТипСети</name>
    <type>
      <types>CatalogRef.абс_ТипыСетей</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникКВ</name>
    <type>
      <types>CatalogRef.абс_КапитальныеВложения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриемникПериодМесяц</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПриемникЦФУ</name>
    <type>
      <types>CatalogRef.абс_ЦФУ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриемникЦФО</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриемникОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриемникСтатьяОборотов</name>
    <type>
      <types>CatalogRef.СтатьиОборотовПоБюджетам</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриемникТипКонтрагента</name>
    <type>
      <types>CatalogRef.абс_ТипыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриемникТипРасхода</name>
    <type>
      <types>CatalogRef.абс_ТипыРасходовНаПроизводствоИРеализацию</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриемникТЭО</name>
    <type>
      <types>CatalogRef.абс_ТЭО</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриемникТипСети</name>
    <type>
      <types>CatalogRef.абс_ТипыСетей</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриемникКВ</name>
    <type>
      <types>CatalogRef.абс_КапитальныеВложения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаЛимита</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаЛимитаВал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.АктОбОказанииПроизводственныхУслуг</types>
      <types>DocumentRef.ТребованиеНакладная</types>
      <types>DocumentRef.ПередачаТоваров</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.ПеремещениеТоваров</types>
      <types>DocumentRef.ПоступлениеТоваровИзПереработки</types>
      <types>DocumentRef.абс_СчетНаОплату</types>
      <types>DocumentRef.АвансовыйОтчет</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.абс_СтатусыРекласификацииБюджета</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаИзмененияСтатуса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.абс_ВидыОперацийРекласификацияБюджета</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНовая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВалНовая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснованиеЗЗ</name>
    <comment>//для лимитов</comment>
    <type>
      <types>DocumentRef.абс_ЗакупочныйЗаказ</types>
      <types>DocumentRef.абс_СчетНаОплату</types>
    </type>
  </attributes>
  <attributes>
    <name>СписыватьЛимит</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникПроект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриемникПроект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийИнициатора</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийДЭФ</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникСценарий</name>
    <type>
      <types>CatalogRef.СценарииПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриемникСценарий</name>
    <type>
      <types>CatalogRef.СценарииПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникОбъектБюджетирования</name>
    <type>
      <types>CatalogRef.ttk_ОбъектыБюджетирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникГород</name>
    <type>
      <types>CatalogRef.ttk_Города</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриемникОбъектБюджетирования</name>
    <type>
      <types>CatalogRef.ttk_ОбъектыБюджетирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриемникГород</name>
    <type>
      <types>CatalogRef.ttk_Города</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Периоды</name>
    <attributes>
      <name>ИсточникПериодМесяц</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВал</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПриемникПериодМесяц</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНовая</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВалНовая</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

eisup_2019_docmng_integration/src/InformationRegisters/абс_ИзменениеСтатусовРекласификацииБюджета/абс_ИзменениеСтатусовРекласификацииБюджета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_ИзменениеСтатусовРекласификацииБюджета</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДолжностьОтветственного</name>
    <type>
      <types>CatalogRef.ДолжностиОрганизаций</types>
    </type>
  </resources>
  <attributes>
    <name>ВнутреннийНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>РекласификацияБюджета</name>
    <type>
      <types>DocumentRef.абс_РеклассификацияБюджетаДДС</types>
      <types>DocumentRef.абс_РеклассификацияБюджета</types>
      <types>DocumentRef.абс_ГрупповаяРеклассификацияБюджета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатусРекласификацииБюджета</name>
    <type>
      <types>EnumRef.абс_СтатусыРекласификацииБюджета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/Enums/абс_ВидыОперацийРекласификацияБюджета/абс_ВидыОперацийРекласификацияБюджета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_ВидыОперацийРекласификацияБюджета</name>
  <enumValues>
    <name>ПереносЛимитовМеждуАналитиками</name>
  </enumValues>
  <enumValues>
    <name>ПереносЛимитовМеждуПериодами</name>
  </enumValues>
  <enumValues>
    <name>ПереносФактаИсполненияБюджета</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/абс_СтатусыРекласификацииБюджета/абс_СтатусыРекласификацииБюджета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_СтатусыРекласификацииБюджета</name>
  <enumValues>
    <name>Подготовка</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДФМ</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДЭИ</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеЦФО</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
  <enumValues>
    <name>Уточнение</name>
  </enumValues>
  <enumValues>
    <name>Проведен</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДК</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеПВП</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеЦФУ</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеЦФОПриемник</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеЦФУПриемник</name>
  </enumValues>
  <enumValues>
    <name>БюджетныйКонтроль</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеБК</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеЦФОПриемникМКР</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеЦФОМКР</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеЭкономистом</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеЭкономистомИсточникМКР</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеЭкономистомПриемникМКР</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/абс_СтатусОрганизации/абс_СтатусОрганизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_СтатусОрганизации</name>
  <enumValues>
    <name>ГоловнаяОрганизация</name>
  </enumValues>
  <enumValues>
    <name>Филиал</name>
  </enumValues>
  <enumValues>
    <name>ДЗО</name>
  </enumValues>
  <enumValues>
    <name>ОбособленноеПодразделение</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Catalogs/абс_ЗакрытиеУправленческихОпераций/абс_ЗакрытиеУправленческихОпераций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>абс_ЗакрытиеУправленческихОпераций</name>
  <comment>//для хранения истории изменений</comment>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПериодЗакрытия</name>
    <attributes>
      <name>Закрыт</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияИзменений</name>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИзменения</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>История</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПрошлыйСписокСтатей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СписокБюджетныхСтатей</name>
    <attributes>
      <name>БюджетнаяСтатья</name>
      <type>
        <types>CatalogRef.СтатьиОборотовПоБюджетам</types>
      </type>
    </attributes>
    <attributes>
      <name>КТТК</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДЗО</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Филиал</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

eisup_2019_docmng_integration/src/Documents/абс_РеклассификацияБюджетаДДС/ObjectModule.bsl
Перем мВалютаРеглУчета Экспорт; 
Перем мСтруктураИсточник Экспорт;
Перем мСтруктураПриемник Экспорт;
Перем врСозданВводомНаОсновании Экспорт;
Перем врФакт Экспорт;
Перем мТекущийПользователь Экспорт;
Перем мРолиПользователя Экспорт;
Перем мПериоды Экспорт;

Процедура ЗаписатьНовыйСтатус(НовыйСтатус, Комментарий = Неопределено) Экспорт
	
	ТекПользователь = глЗначениеПеременной("глТекущийПользователь");
	
	НаборЗаписей = РегистрыСведений.абс_ИзменениеСтатусовРекласификацииБюджета.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.РекласификацияБюджета.Установить(Ссылка);
	НаборЗаписей.Прочитать();
	
	Запись = НаборЗаписей.Добавить();
	Запись.Период = абс_СерверныеФункции.ПолучитьДатуСервера();

	Запись.РекласификацияБюджета		= Ссылка;
	Запись.Пользователь 				= ТекПользователь;	
	Запись.СтатусРекласификацииБюджета	= НовыйСтатус;
	
	Запись.Комментарий 					= Комментарий;
	
	ОтветственныйСотрудник = абс_БизнесПроцессы.ПолучитьСотрудникаПользователя(ТекПользователь);
	
	Если НЕ ОтветственныйСотрудник = Неопределено Тогда
		Запись.ДолжностьОтветственного	= ОтветственныйСотрудник.Должность;
	КонецЕсли;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура СоздатьСтруктуруИсточника(СтрокаПериоды = Неопределено, Год) Экспорт
	
	мСтруктураИсточник = Новый Структура;
	мСтруктураПриемник = Новый Структура;
	Для каждого Реквизит из ЭтотОбъект.Метаданные().Реквизиты Цикл
		Если Найти(Реквизит.Имя,"Источник")>0 Тогда
			мСтруктураИсточник.Вставить(СтрЗаменить(Реквизит.Имя,"Источник",""), ЭтотОбъект[Реквизит.Имя]);
		КонецЕсли;
		
		Если Найти(Реквизит.Имя,"Приемник")>0 Тогда
			мСтруктураПриемник.Вставить(СтрЗаменить(Реквизит.Имя,"Приемник",""), ЭтотОбъект[Реквизит.Имя]);
		КонецЕсли;
	КонецЦикла;
	
	Если (мПериоды <> '00010101' И Дата >= мПериоды) И ВидОперации = Перечисления.абс_ВидыОперацийРекласификацияБюджета.ПереносЛимитовМеждуПериодами И Не Год Тогда
		мСтруктураИсточник.ПериодМесяц = СтрокаПериоды.ИсточникПериодМесяц;
		мСтруктураПриемник.ПериодМесяц = СтрокаПериоды.ПриемникПериодМесяц;
	КонецЕсли;
	
	//мСтруктураИсточник.Вставить("НачалоПериода", НачалоМесяца(мСтруктураИсточник.ПериодМесяц));      //АБС Коломиец 19806
	//мСтруктураИсточник.Вставить("КонецПериода", КонецМесяца (мСтруктураИсточник.ПериодМесяц));
	//
	мСтруктураИсточник.Вставить("НачалоПериода", ?(Год, НачалоГода(мСтруктураИсточник.ПериодМесяц), НачалоМесяца(мСтруктураИсточник.ПериодМесяц)));
	мСтруктураИсточник.Вставить("КонецПериода",  ?(Год, КонецГода(мСтруктураИсточник.ПериодМесяц), КонецМесяца (мСтруктураИсточник.ПериодМесяц)));
	//+++ НФС 2018
	мСтруктураИсточник.Вставить("ОбъектБюджетирования", ИсточникОбъектБюджетирования);
	//--- НФС 2018
	
	мСтруктураПриемник.Вставить("НачалоПериода", ?(Год, НачалоГода(мСтруктураПриемник.ПериодМесяц), НачалоМесяца(мСтруктураПриемник.ПериодМесяц)));
	мСтруктураПриемник.Вставить("КонецПериода",  ?(Год, КонецГода(мСтруктураПриемник.ПериодМесяц), КонецМесяца (мСтруктураПриемник.ПериодМесяц)));
	//+++ НФС 2018
	мСтруктураПриемник.Вставить("ОбъектБюджетирования", ПриемникОбъектБюджетирования);
	//--- НФС 2018

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//АБС ВСТАВКА №36480 НАЧАЛО
	абс_БюджетированиеПривилегированный.абс_РеклассификацияБюджетаОчиститьДвижения(Ссылка);
	//АБС ВСТАВКА №36480 КОНЕЦ
	
	//АБС Коломиец 19806+
	ПереносМеждуПериодами = (мПериоды <> '00010101' И Дата >= мПериоды) И (ВидОперации = Перечисления.абс_ВидыОперацийРекласификацияБюджета.ПереносЛимитовМеждуПериодами); //АБС Коломиец 19806+
	
	Если ПереносМеждуПериодами Тогда  
		Если Периоды.Итог("Сумма") <> Периоды.Итог("СуммаНовая") Тогда
			ttk_ОбщегоНазначения.СообщитьОбОшибке("Сумма по периодам источника не равна сумме по периодам приемника!", Отказ);
		КонецЕсли;
		Если Периоды.Итог("СуммаВал") <> Периоды.Итог("СуммаВалНовая") Тогда
			ttk_ОбщегоНазначения.СообщитьОбОшибке("Сумма вал. по периодам источника не равна сумме вал. по периодам приемника!", Отказ);
		КонецЕсли;	
		Если Отказ Тогда 
			Возврат;
		КонецЕсли;		 
	КонецЕсли;	
	
	Сч = ?(ПереносМеждуПериодами, Периоды.Количество(), 1); 
	Инд = 0;	
	
	Пока Инд < Сч Цикл
		//АБС Коломиец 19806-	
		
		Если Не ЗначениеЗаполнено(мВалютаРеглУчета) Тогда
			мВалютаРеглУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
		КонецЕсли;	
		
		//АБС Коломиец 19806+
		Если ПереносМеждуПериодами Тогда  		 
			СуммаТек = Периоды[Инд].Сумма;
			СуммаЛимитаТек = Периоды[Инд].Сумма;
			СуммаВалТек = Периоды[Инд].СуммаВал;
			СуммаЛимитаВалТек = Периоды[Инд].СуммаВал;	
			СуммаТекПриемника = Периоды[Инд].СуммаНовая;
			СуммаВалТекПриемника = Периоды[Инд].СуммаВалНовая;		
			Если СуммаТек = 0 И СуммаЛимитаТек = 0 И СуммаТекПриемника = 0 И СуммаВалТек = 0 И СуммаЛимитаВалТек = 0 И СуммаВалТекПриемника = 0 Тогда
				Инд = Инд + 1;
				Продолжить;
			КонецЕсли;
			СоздатьСтруктуруИсточника(Периоды[Инд], Ложь);
		Иначе 
			СоздатьСтруктуруИсточника(Неопределено, Ложь);
			СуммаТек = Сумма;
			СуммаЛимитаТек = СуммаЛимита;
			СуммаВалТек = СуммаВал;
			СуммаЛимитаВалТек = СуммаЛимитаВал;	
			СуммаТекПриемника = 0;
			СуммаВалТекПриемника = 0;		
		КонецЕсли;   
		Инд = Инд + 1;
		//АБС Коломиец 19806-
		
		Если ЗначениеЗаполнено(ИсточникСценарий) и НЕ ВидОперации = Перечисления.абс_ВидыОперацийРекласификацияБюджета.ПереносФактаИсполненияБюджета
			И Не (ПереносМеждуПериодами И СуммаТек = 0 И СуммаЛимитаТек = 0 И СуммаВалТек = 0 И СуммаЛимитаВалТек = 0) Тогда
			
			прСценарий = ИсточникСценарий;                   
			//АБС ВСТАВКА №36480,13573 НАЧАЛО
			Остаток = абс_БюджетированиеПривилегированный.ПостроитьЗапросПоОстаткам(мСтруктураИсточник,ВалютаДокумента, Ложь, прСценарий, Истина, Истина);
			//АБС ВСТАВКА №36480 КОНЕЦ
			
			Если ВалютаДокумента = мВалютаРеглУчета Тогда
				ДобавленнаяСумма = СуммаТек;
				ДобавленныйЛимит = СуммаЛимитаТек;
			Иначе
				ДобавленнаяСумма = СуммаВалТек;
				ДобавленныйЛимит = СуммаЛимитаВалТек;
			КонецЕсли;
			
			Если Остаток.СуммаОстатокЛимита-ДобавленныйЛимит<0 Тогда
				Отказ = Истина;
				ttk_ОбщегоНазначения.СообщитьОбОшибке("В периоде " +абс_СлужебныеФункции.ВернутьНазваниеМесяца(мСтруктураИсточник.ПериодМесяц) + " " + Формат(мСтруктураИсточник.ПериодМесяц,"ДФ=yyyy") + " г."+ 
				"Превышен лимит по набору аналитик источника!",Отказ);
			КонецЕсли;
			
			Если Остаток.СуммаПлан - ДобавленнаяСумма < 0 Тогда
				Отказ = Истина;
				ttk_ОбщегоНазначения.СообщитьОбОшибке("В периоде " +абс_СлужебныеФункции.ВернутьНазваниеМесяца(мСтруктураИсточник.ПериодМесяц) + " " + Формат(мСтруктураИсточник.ПериодМесяц,"ДФ=yyyy") + " г."+
				"После реклассификации в бюджет будет занесена отрицательная сумма!",Отказ);
			КонецЕсли;
			
			Если Отказ Тогда
				возврат;
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ Статус = Перечисления.абс_СтатусыРекласификацииБюджета.Проведен Тогда 
			//Возврат;
			//ttk_ОбщегоНазначения.СообщитьОбОшибке("Документ рекласификации проводится только в статусе ""Проведен"".", Отказ);
			Продолжить;
		КонецЕсли;
		
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		
		//АБС ВСТАВКА №36480 НАЧАЛО
		абс_БюджетированиеПривилегированный.абс_РеклассификацияБюджетаДобавитьДвиженияДДС(Ссылка, Отказ, мСтруктураПриемник, мСтруктураИсточник,ПереносМеждуПериодами,
						СуммаТек,СуммаЛимитаТек,СуммаВалТек,СуммаЛимитаВалТек,СуммаТекПриемника,СуммаВалТекПриемника);
		//\\АБС ВСТАВКА №36480 КОНЕЦ
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПоРегистру(ИмяРегистра,ДанныеЗаполнения,СоответствиеРесурсов)
	
	Попытка 		
		ВсеИзмерения = "Период,Регистратор,Активность";
		ВсеРесурсы   = "";
        //Заполнить данные по движениям документа - документ основание
		Движение = ДанныеЗаполнения.Метаданные().Движения;
		Для каждого Строка Из Движение Цикл  			
			Если Строка.Имя = ИмяРегистра Тогда	
				
				Для Каждого Измерение Из Строка.Измерения Цикл
					ВсеИзмерения = ВсеИзмерения + "," + Измерение.Имя; 
				КонецЦикла;
				Для Каждого Ресурсы Из Строка.Ресурсы Цикл
					ВсеРесурсы = ВсеРесурсы + "," + Ресурсы.Имя; 
				КонецЦикла;
				ВсеРесурсы = Сред(ВсеРесурсы,2);
				
				врДокумент = ДанныеЗаполнения.ПолучитьОбъект();
				врДокумент.Движения[ИмяРегистра].Прочитать();				
				Если врДокумент.Движения[ИмяРегистра].Количество() > 0 Тогда					
	                //Таблица для обработки
					ТаблицаДляОбработки = врДокумент.Движения[ИмяРегистра].Выгрузить();
					ТаблицаДляОбработки.Свернуть(ВсеИзмерения,ВсеРесурсы);
					ТаблицаДляОбработки.Сортировать("Сценарий Убыв");//что бы взять строку только "3. Факт"
													
					Если ТаблицаДляОбработки.Количество() > 0 Тогда
														
						// Заполнение шапки
						ЗаполнитьПоТаблице("ИсточникСтатьяОборотов","СтатьяОборотов"     ,ТаблицаДляОбработки[0]);
						ЗаполнитьПоТаблице("ИсточникКВ"            ,"абс_КВ"             ,ТаблицаДляОбработки[0]);
					    ЗаполнитьПоТаблице("ИсточникОрганизация"   ,"Организация"        ,ТаблицаДляОбработки[0]);
					    ЗаполнитьПоТаблице("ИсточникТипКонтрагента","абс_ТипКонтрагента" ,ТаблицаДляОбработки[0]);
					    ЗаполнитьПоТаблице("ИсточникТипРасхода"    ,"абс_ТипРасхода"     ,ТаблицаДляОбработки[0]);
						ЗаполнитьПоТаблице("ИсточникТипСети"       ,"абс_ТипСети"        ,ТаблицаДляОбработки[0]);
						ЗаполнитьПоТаблице("ИсточникТЭО"           ,"абс_ТЭО"            ,ТаблицаДляОбработки[0]);
						ЗаполнитьПоТаблице("ИсточникЦФО"           ,"ЦФО"            	 ,ТаблицаДляОбработки[0]);
						ЗаполнитьПоТаблице("ИсточникЦФУ"           ,"абс_ЦФУ"            ,ТаблицаДляОбработки[0]);
						ЗаполнитьПоТаблице("Сценарий"              ,"Сценарий"           ,ТаблицаДляОбработки[0]);
						//Число
						Для каждого врСтрока Из СоответствиеРесурсов Цикл
							ЗаполнитьПоТаблице(врСтрока.Ключ,врСтрока.Значение,ТаблицаДляОбработки[0]);							
						КонецЦикла;
					
					КонецЕсли;		
					
				КонецЕсли;
				
			КонецЕсли;	
			
		КонецЦикла;	
	
	Исключение
		//Не удалось заполнить по движениям
	КонецПопытки;
	
	
КонецПроцедуры	

Функция ПолучитьТаблицуИзДокумента(ДанныеЗаполнения, ИмяРегистра = "ОборотыБюджетов",СписокСценариевДДС = Неопределено) Экспорт
	
	врТаблица = Новый ТаблицаЗначений;
	врТаблица.Колонки.Добавить("Флажок");
	врТаблица.Колонки.Добавить("ИсточникПериодМесяц");
	врТаблица.Колонки.Добавить("ИсточникЦФУ");
	врТаблица.Колонки.Добавить("ИсточникЦФО");
	врТаблица.Колонки.Добавить("ИсточникОрганизация");
	врТаблица.Колонки.Добавить("ИсточникСтатьяОборотов");
	врТаблица.Колонки.Добавить("ИсточникТипКонтрагента");
	врТаблица.Колонки.Добавить("ИсточникТипРасхода");
	врТаблица.Колонки.Добавить("ИсточникТЭО");
	врТаблица.Колонки.Добавить("ИсточникТипСети");
	врТаблица.Колонки.Добавить("ИсточникКВ");
	врТаблица.Колонки.Добавить("Сумма");
	врТаблица.Колонки.Добавить("СуммаВал");
	врТаблица.Колонки.Добавить("Количество");	
	//АБС ВСТАВКА №40552 НАЧАЛО «17 апреля 2014 г.», Пополитов
	врТаблица.Колонки.Добавить("ИсточникСценарий");
	врТаблица.Колонки.Добавить("ПриемникСценарий");
	Если СписокСценариевДДС = Неопределено Тогда		
		Если ЗначениеЗаполнено(ДанныеЗаполнения) 
			и не ДанныеЗаполнения.Метаданные().Реквизиты.Найти("Организация") = Неопределено Тогда
			СписокСценариевДДС = абс_Бюджетирование.ПолучитьСценарийДляКонтроляДДС(ДанныеЗаполнения.Организация);
		Иначе	
			Возврат врТаблица;
		КонецЕсли; 
	КонецЕсли;		
	//\\АБС ВСТАВКА №40552 КОНЕЦ
	
	Попытка 		
		ВсеИзмерения = "Период,Регистратор,Активность";
		ВсеРесурсы   = "";
		//Заполнить данные по движениям документа - документ основание
		Движение = ДанныеЗаполнения.Метаданные().Движения;           
		Для каждого Строка Из Движение Цикл  			
			Если Строка.Имя = ИмяРегистра Тогда	
				
				Для Каждого Измерение Из Строка.Измерения Цикл
					ВсеИзмерения = ВсеИзмерения + "," + Измерение.Имя; 
				КонецЦикла;
				Для Каждого Ресурсы Из Строка.Ресурсы Цикл
					ВсеРесурсы = ВсеРесурсы + "," + Ресурсы.Имя; 
				КонецЦикла;
				ВсеРесурсы = Сред(ВсеРесурсы,2);
				
				врДокумент = ДанныеЗаполнения.ПолучитьОбъект();
				врДокумент.Движения[ИмяРегистра].Прочитать();				
				Если врДокумент.Движения[ИмяРегистра].Количество() > 0 Тогда					
					//Таблица для обработки
					ТаблицаДляОбработки = врДокумент.Движения[ИмяРегистра].Выгрузить();
					ТаблицаДляОбработки.Свернуть(ВсеИзмерения,ВсеРесурсы);
					ТаблицаДляОбработки.Сортировать("Период Убыв");
					
					Для каждого Строка Из ТаблицаДляОбработки Цикл
						
						//АБС ВСТАВКА №40552 НАЧАЛО «17 апреля 2014 г.», Пополитов
						Если не ЗначениеЗаполнено(Строка.Сценарий)
							или СписокСценариевДДС.НайтиПоЗначению(Строка.Сценарий) = Неопределено Тогда
							Продолжить;
						КонецЕсли;
						//\\АБС ВСТАВКА №40552 КОНЕЦ
						
						врСтр = врТаблица.Добавить();
						врСтр.Флажок 					= Ложь;
						врСтр.ИсточникПериодМесяц 		= Строка.Период;
						врСтр.ИсточникЦФУ 				= Строка.абс_ЦФУ;
						врСтр.ИсточникЦФО 				= Строка.ЦФО;
						врСтр.ИсточникОрганизация 		= Строка.Организация;
						врСтр.ИсточникСтатьяОборотов 	= Строка.СтатьяОборотов;
						врСтр.ИсточникТипКонтрагента 	= Строка.абс_ТипКонтрагента;
						врСтр.ИсточникТипРасхода 		= Строка.абс_ТипРасхода;
						врСтр.ИсточникТЭО 				= Строка.абс_ТЭО;
						врСтр.ИсточникТипСети 			= Строка.абс_ТипСети;
						врСтр.ИсточникКВ 				= Строка.абс_КВ;
						Если НЕ ИмяРегистра = "ОборотыБюджетов" Тогда
							врСтр.Сумма 				= Строка.СуммаСценарияИсполнение;
							врСтр.СуммаВал 				= Строка.СуммаСценарияИсполнениеВал;					
						Иначе	
							врСтр.Сумма 				= Строка.СуммаСценария;
							врСтр.СуммаВал 				= Строка.ВалютнаяСумма;
							врСтр.Количество 			= Строка.Количество;
						КонецЕсли;
						//АБС ВСТАВКА №40552 НАЧАЛО «17 апреля 2014 г.», Пополитов
						врСтр.ИсточникСценарий 			= Строка.Сценарий;
						врСтр.ПриемникСценарий 			= Строка.Сценарий;
						//\\АБС ВСТАВКА №40552 КОНЕЦ
					КонецЦикла;	
				КонецЕсли;
			КонецЕсли;	
		КонецЦикла;	
	Исключение
		//Не удалось заполнить по движениям
	КонецПопытки;
	             	
	Возврат врТаблица;
	
КонецФункции	

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	врСозданВводомНаОсновании = Истина;	
	
	Попытка		
		ДокументОснование = ДанныеЗаполнения.Ссылка; 				
	Исключение
		//пропускаем
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗаполнитьПоРеквизизиту(ИмяПриемник,ИмяИсточник,ДанныеЗаполнения)
	
	Попытка	
		Если ДанныеЗаполнения.Метаданные().Реквизиты.Найти(ИмяИсточник) <> Неопределено	и ЭтотОбъект.Метаданные().Реквизиты.Найти(ИмяПриемник) <> Неопределено Тогда
			Если НЕ ЗначениеЗаполнено(ЭтотОбъект[ИмяПриемник]) Тогда
				ЭтотОбъект[ИмяПриемник] = ДанныеЗаполнения[ИмяИсточник];
			КонецЕсли;	
		КонецЕсли;	
	Исключение
	КонецПопытки;
	
КонецПроцедуры	

Процедура ЗаполнитьПоТаблице(ИмяПриемник,ИмяИсточник,СтрокаТаблицы)
	
	Попытка	
		Если ЭтотОбъект.Метаданные().Реквизиты.Найти(ИмяПриемник) <> Неопределено Тогда			
			Если НЕ ЗначениеЗаполнено(ЭтотОбъект[ИмяПриемник]) Тогда
				ЭтотОбъект[ИмяПриемник] = СтрокаТаблицы[ИмяИсточник];
			КонецЕсли;				
		КонецЕсли;		
	Исключение
	КонецПопытки;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") или ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.АвансовыйОтчет") Тогда		
		Если НЕ ЗначениеЗаполнено(ДокументОснованиеЗЗ) и НЕ СписыватьЛимит Тогда
			Сообщить("Документ лимитов не заполнен, лимиты не изменены!");
		КонецЕсли;		
	КонецЕсли;
	
	//АБС ВСТАВКА №40552 НАЧАЛО «17 апреля 2014 г.», Пополитов
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.абс_СчетНаОплату") и ЗначениеЗаполнено(ДокументОснование) и ДокументОснование <> ДокументОснованиеЗЗ Тогда
		ДокументОснованиеЗЗ = ДокументОснование;	       		
	КонецЕсли;
	Если ТипЗнч(ДокументОснованиеЗЗ) = Тип("ДокументСсылка.абс_СчетНаОплату") и ЗначениеЗаполнено(ДокументОснованиеЗЗ) и ДокументОснование <> ДокументОснованиеЗЗ Тогда 			
		ДокументОснование = ДокументОснованиеЗЗ;	       		
	КонецЕсли;	
	//\\АБС ВСТАВКА №40552 КОНЕЦ 	
	
	Если ЗначениеЗаполнено(ДокументОснованиеЗЗ)	и не ТипЗнч(ДокументОснованиеЗЗ) = Тип("ДокументСсылка.абс_СчетНаОплату") и ДокументОснованиеЗЗ.НефиксированнаяСумма Тогда
		СписыватьЛимит = истина;	
	КонецЕсли;
	
	Если не ЗначениеЗаполнено(ИсточникСценарий) и не ВидОперации = Перечисления.абс_ВидыОперацийРекласификацияБюджета.ПереносФактаИсполненияБюджета Тогда
		ttk_ОбщегоНазначения.СообщитьОбОшибке("Не заполнен сценарий источник!",Отказ);	
	КонецЕсли;	
	
	Если не ЗначениеЗаполнено(ПриемникСценарий) и не ВидОперации = Перечисления.абс_ВидыОперацийРекласификацияБюджета.ПереносЛимитовМеждуПериодами Тогда
		ttk_ОбщегоНазначения.СообщитьОбОшибке("Не заполнен сценарий приёмник!",Отказ);	
	КонецЕсли;	 	
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Статус = Перечисления.абс_СтатусыРекласификацииБюджета.Подготовка;
	
КонецПроцедуры

Функция НеобходимоУтверждениеПВП() Экспорт  
	
	Если ПриемникСтатьяОборотов.абс_СверхБюджет ИЛИ ИсточникСтатьяОборотов.абс_СверхБюджет Тогда 
	     Возврат Истина;
	 Иначе		 
		 Возврат Ложь;		
	КонецЕсли;
	
КонецФункции

Функция БюджетныйКонтрольВкл() Экспорт
	
	Если не глЗначениеПеременной("абс_ПомесячноеЗакрытиеУправленческихОпераций") Тогда
		Возврат Ложь;
	КонецЕсли;	
	
	МассивПериодов = Новый Массив;
	МассивПериодов.Добавить(НачалоМесяца(ИсточникПериодМесяц));
	МассивПериодов.Добавить(НачалоМесяца(ПриемникПериодМесяц));
	Для каждого Строка Из Периоды Цикл
		Если не ВидОперации = Перечисления.абс_ВидыОперацийРекласификацияБюджета.ПереносЛимитовМеждуПериодами Тогда
			Продолжить;
		КонецЕсли;		
		Если ЗначениеЗаполнено(Строка.Сумма) Тогда
			МассивПериодов.Добавить(НачалоМесяца(Строка.ИсточникПериодМесяц));
		КонецЕсли;
		Если ЗначениеЗаполнено(Строка.СуммаНовая) Тогда
			МассивПериодов.Добавить(НачалоМесяца(Строка.ПриемникПериодМесяц));
		КонецЕсли;
	КонецЦикла;	
	
	МассивСтатусОрганизации = Новый Массив;
	МассивСтатусОрганизации.Добавить(ИсточникОрганизация.абс_СтатусОрганизации);
	МассивСтатусОрганизации.Добавить(ПриемникОрганизация.абс_СтатусОрганизации);	
	
	МассивБюджетнаяСтатья = Новый Массив;
	МассивБюджетнаяСтатья.Добавить(ИсточникСтатьяОборотов);
	МассивБюджетнаяСтатья.Добавить(ПриемникСтатьяОборотов);	
	
	Запрос = Новый Запрос;          
	Запрос.УстановитьПараметр("МассивПериодов",МассивПериодов);
	Запрос.УстановитьПараметр("СтатусОрганизации",МассивСтатусОрганизации);
	Запрос.УстановитьПараметр("БюджетнаяСтатья",МассивБюджетнаяСтатья);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ЗакрытиеУУ.Ссылка
	               |ПОМЕСТИТЬ вр
	               |ИЗ
	               |	Справочник.абс_ЗакрытиеУправленческихОпераций.ПериодЗакрытия КАК ЗакрытиеУУ
	               |ГДЕ
	               |	(НЕ ЗакрытиеУУ.Ссылка.ПометкаУдаления)
	               |	И НАЧАЛОПЕРИОДА(ЗакрытиеУУ.Период, МЕСЯЦ) В (&МассивПериодов)
	               |	И ЗакрытиеУУ.Закрыт
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	абс_ЗакрытиеУправленческихОперацийСписокБюджетныхСтатей.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.абс_ЗакрытиеУправленческихОпераций.СписокБюджетныхСтатей КАК абс_ЗакрытиеУправленческихОперацийСписокБюджетныхСтатей
	               |ГДЕ
	               |	абс_ЗакрытиеУправленческихОперацийСписокБюджетныхСтатей.Ссылка В
	               |			(ВЫБРАТЬ
	               |				вр.Ссылка
	               |			ИЗ
	               |				вр КАК вр)
	               |	И ВЫБОР
	               |			КОГДА ЗНАЧЕНИЕ(Перечисление.абс_СтатусОрганизации.ГоловнаяОрганизация) В (&СтатусОрганизации)
	               |				ТОГДА абс_ЗакрытиеУправленческихОперацийСписокБюджетныхСтатей.КТТК
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА ЗНАЧЕНИЕ(Перечисление.абс_СтатусОрганизации.ДЗО) В (&СтатусОрганизации)
	               |				ТОГДА абс_ЗакрытиеУправленческихОперацийСписокБюджетныхСтатей.ДЗО
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА ЗНАЧЕНИЕ(Перечисление.абс_СтатусОрганизации.Филиал) В (&СтатусОрганизации)
	               |				ТОГДА абс_ЗакрытиеУправленческихОперацийСписокБюджетныхСтатей.Филиал
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |	И абс_ЗакрытиеУправленческихОперацийСписокБюджетныхСтатей.БюджетнаяСтатья В(&БюджетнаяСтатья)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	абс_ЗакрытиеУправленческихОперацийСписокБюджетныхСтатей.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ вр";
	                         	
	Возврат не Запрос.Выполнить().Пустой();
	                         	
КонецФункции	

врФакт = глЗначениеПеременной("абс_СценарийДДС");
мТекущийПользователь = глЗначениеПеременной("глТекущийПользователь");
мРолиПользователя = абс_БизнесПроцессы.ПолучитьСписокДоступныхРолейПользователя(мТекущийПользователь);
мПериоды =  глЗначениеПеременной("абс_ДатаНачалаИспользованияПериодовВРеклассе");
